'''
1.算数运算符

// 整除
% 取余
** 指数

优先级：
（） ** *  / // % + -
'''


'''
2.赋值运算符

=

'''

num1,float1,str1=10,0.5,'hello world'
print(num1)
print(float1)
print(str1)

a=b=10
print(a)
print(b)

"""
3.复合赋值运算符
+= 先+后赋值
-=
*=
/=
//=
%=
**=
"""

"""
4.比较运算符
==
!=
>
<
>=
<=
"""

"""
5.逻辑运算符
and
or
not
"""

"""
位运算

2^0 = 1

有1的才成

十进制14
2^3  2^2 2^1 
1      1   1 0
十进制9
2^3     2^0
1   0 0 1

&运算 1000
|运算 1111

移位操作

0100

左移 << 0001 0000
右移 >> 0001

"""
print(14&9)
print(14|9)
print(4<<2) # 4向左移动2位 4*2 8*2
print(4>>2) # 4向右移动2位 4/2 2/2